openocd-org/openocd/src/target/mpc57xx.c
/***************************************************************************
 *   Copyright (C) 2017 by James Murray <james@nscc.info                   *
 *   Based on code:                                                        *
 *       Copyright (C) 2010 by Oleksandr Tymoshenko <gonzo@bluezbox.com>   *
 *   Based on mips_m4k code:                                               *
 *       Copyright (C) 2008 by Spencer Oliver <spen@spen-soft.co.uk>       *
 *       Copyright (C) 2008 by David T.L. Wong                             *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program.  If not, see <http://www.gnu.org/licenses/>. *
 ***************************************************************************/

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include "jtag/jtag.h"
#include "register.h"
#include "algorithm.h"
#include "target.h"
#include "breakpoints.h"
#include "target_type.h"
#include "mpc5xxx_jtag.h"
#include "mpc5xxx.h"
#include "mpc56xx_regs.h"
#include "mpc56xx.h"
#include "mpc57xx_jtag.h"
#include "mpc57xx_regs.h"
#include "mpc57xx.h"
#include "jtag/interface.h"


static enum target_state cur_state; /* tmp */


int mpc57xx_configure_break_unit(struct target *target)
{
	/* get pointers to arch-specific information */
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);

	if (mpc57xx->bp_scanned)
		return ERROR_OK;

	mpc57xx->num_inst_bpoints = MPC57XX_NUM_BPS; /* MPC5634M */
	mpc57xx->num_inst_bpoints_avail = mpc57xx->num_inst_bpoints;
	mpc57xx->inst_break_list = calloc(mpc57xx->num_inst_bpoints,
		sizeof(struct mpc5xxx_comparator));

	mpc57xx->num_data_bpoints = MPC57XX_NUM_WPS; /* MPC5634M */
	mpc57xx->num_data_bpoints_avail = mpc57xx->num_data_bpoints;
	mpc57xx->data_break_list = calloc(mpc57xx->num_data_bpoints,
		sizeof(struct mpc5xxx_comparator));

	mpc57xx->bp_scanned = 1;

	return ERROR_OK;
}


/* enable (state=1) or disable (state=0) interrupts on halt and resume  */
/* need to disable EE in MCR before single stepping, to guarantee execution */
/* so may as well just leave it like this with no extra overhead .??   */
static int mpc57xx_enable_interrupts(struct target *target, int state)
{
	uint32_t val ;
	uint32_t opcode = state ? 0x7c008146 : 0x7c000146 ;
	struct mpc5xxx_jtag *jtag_info = &target_to_mpc5xxx(target)->jtag ;
	return  mpc57xx_exec_inst(jtag_info, opcode, 0, &val, 0);
}


static int mpc57xx_debug_entry(struct target *target, int async_flag)
{
	int retval;
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);

	/* Here we need to determine which OnCE we want to talk to.
	 * FIXME. Need to add support for SMP.
	 */
	mpc57xx->jtag.once = MPC57XX_TAP_ONCE1; /* Default to CPU1 */
	mpc57xx->jtag.current_tap = MPC5XXX_TAP_INVALID; /* Invalid to force TAP selection */
	mpc57xx->jtag.jtag_irlen = 6;

	printf("Debug entry !\n");
	retval = mpc57xx_enter_debug(&mpc57xx->jtag, async_flag);
	if (retval)
		return retval;

	register_cache_invalidate(mpc57xx->core_cache);
	/*printf("About to save_context\n");*/
	mpc57xx_save_context(target);
	/* Force to say we are halted. Debug/halt appear to be synonymous? */
	target->state = TARGET_HALTED;
	mpc57xx->ctl_on_entry = mpc57xx->saved_ctl ;
	mpc57xx->msr_on_entry = mpc57xx->saved_msr ;

	printf("MSR on entry is 0x%08x\n", mpc57xx->msr_on_entry);
	printf("CTL on entry is 0x%08x\n", mpc57xx->ctl_on_entry);

	/* get all the debug registers! */
	const struct {
		int addr ;
		char *name ;
	} debug_regs[] = {
			{MPC57XX_ONCE_DBCR0, "DBCR0"},
			{MPC57XX_ONCE_DBCR1, "DBCR1"},
			{MPC57XX_ONCE_DBCR2, "DBCR2"},
			{MPC57XX_ONCE_DBCR4, "DBCR4"},
			{MPC57XX_ONCE_DBCR5, "DBCR5"},
			{MPC57XX_ONCE_DBCR6, "DBCR6"},
			{MPC57XX_ONCE_DBCR7, "DBCR7"},
			{MPC57XX_ONCE_DBCR8, "DBCR8"},
			{MPC57XX_ONCE_DBSR, "DBSR"},
			/*{574, "DSRR0"},
			{575, "DSRR1"}*/
	};
	const int num_db_regs = sizeof(debug_regs) / sizeof(debug_regs[0]) ;

	for (int i = 0 ; i < num_db_regs ; i++) {
		uint32_t val ;
		uint32_t res = mpc5xxx_once_read(&mpc57xx->jtag, debug_regs[i].addr, &val, 32) ;
		printf("%s (spr:%d) = 0x%08x\n", debug_regs[i].name, debug_regs[i].addr, res ? 0xdeadbeef : val);
	}

	retval = mpc5xxx_once_write(&mpc57xx->jtag, MPC57XX_ONCE_DBSR, 0xffffffff, 32);
	if (retval)
		return retval;



	/* make sure break unit configured */
	mpc57xx_configure_break_unit(target);

	target_call_event_callbacks(target, TARGET_EVENT_GDB_HALT);

	return ERROR_OK;
}

static int mpc57xx_poll(struct target *target)
{
	uint32_t osr, tmp;
	int retval;
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);

	retval = mpc5xxx_once_read(&mpc57xx->jtag, MPC57XX_ONCE_DBSR, &tmp, 32);
	if (retval)
		return retval;
	if (tmp) {
		/*printf("DBSR = 0x%08x\n", tmp);*/
		;
	}

	retval = mpc5xxx_once_osr_read(&mpc57xx->jtag, &osr);
	if (retval != ERROR_OK)
		return retval;

	if (cur_state != target->state) {
		printf("Current target->state = %d : %s\n", target->state, target_state_name(target));
		cur_state = target->state;
	}

	/* debug and halt appear to be synonymous */
	if (osr & (MPC5XXX_OSR_HALT | MPC5XXX_OSR_DEBUG)) {
		if ((target->state == TARGET_RUNNING) || (target->state == TARGET_RESET)) {
			target->state = TARGET_HALTED;

			printf("no.1\n");
			retval = mpc57xx_debug_entry(target, 0);
			if (retval != ERROR_OK)
				return retval;

			/*target_call_event_callbacks(target, TARGET_EVENT_HALTED);*/
			target_call_event_callbacks(target, TARGET_EVENT_DEBUG_HALTED);
		} else if (target->state == TARGET_DEBUG_RUNNING) {
			target->state = TARGET_HALTED;

			printf("no.2\n");
			retval = mpc57xx_debug_entry(target, 1);
			if (retval != ERROR_OK)
				return retval;

			target_call_event_callbacks(target, TARGET_EVENT_DEBUG_HALTED);
		}

	} else if (target->state == TARGET_DEBUG_RUNNING) { /* JSM */

