openocd-org/openocd/src/target/mpc57xx.c
		printf("no.3\n");
		retval = mpc57xx_debug_entry(target, 1);
		if (retval != ERROR_OK)
			return retval;

		target_call_event_callbacks(target, TARGET_EVENT_DEBUG_HALTED);

	} else {
		if (target->state != TARGET_DEBUG_RUNNING)
			target->state = TARGET_RUNNING;
	}


	return ERROR_OK;
}

#define MPC57XX_BOOTADDR 0xf9c000
/* Read the boot address from flash
 * Simplified version that only reads from 0 address.
 * Ought to read from the multiple possible addresses.
 */
static int mpc57xx_read_boot_vector(struct target *target, uint32_t *addr)
{
	int retval;
	uint32_t ad;

	*addr = 0;

	retval = target_read_memory(target, MPC57XX_BOOTADDR, 4, 1, (uint8_t *)&ad);
	if (retval != ERROR_OK)
		return retval;
	if (ad != 0x5a00) { /* 0x005a0000 BE */
		printf("Didn't find a boot record at *0x%08x, found 0x%08x\n", MPC57XX_BOOTADDR, ad);
		/*return ERROR_FAIL;*/
		*addr = MPC57XX_BOOTADDR; /* At least it is readable flash */
		return ERROR_OK;
	}
	printf("Check *0x%08x = 0x%08x\n", MPC57XX_BOOTADDR, ad);

	retval = target_read_memory(target, MPC57XX_BOOTADDR + 4, 4, 1, (uint8_t *)&ad);
	if (retval != ERROR_OK)
		return retval;
	*addr = ((ad & 0x000000ff) << 24)
				| ((ad & 0x0000ff00) << 8)
				| ((ad & 0x00ff0000) >> 8)
				| ((ad & 0xff000000) >> 24);
	printf("Check *0x%08x = 0x%08x\n", MPC57XX_BOOTADDR + 4, *addr);

	return ERROR_OK;
}


/* Initialise flash wait states. From AN4670 */
static int mpc57xx_init_flash_ws(struct target *target)
{
	int retval;
	uint32_t val;

	printf("init_flash_ws ");
	val = 0x00004554;
	retval = mpc5xxx_write_memory(target, MPC57XX_FLASH_PFCR1,
		4, 1, (uint8_t *)&val);
	if (retval)
		return retval;

	val = 0x00000054;
	retval = mpc5xxx_write_memory(target, MPC57XX_FLASH_PFCR2,
		4, 1, (uint8_t *)&val);
	if (retval)
		return retval;

	val = 0x00004555;
	retval = mpc5xxx_write_memory(target, MPC57XX_FLASH_PFCR1,
		4, 1, (uint8_t *)&val);
	if (retval)
		return retval;

	val = 0x00000055;
	retval = mpc5xxx_write_memory(target, MPC57XX_FLASH_PFCR2,
		4, 1, (uint8_t *)&val);
	if (retval)
		return retval;

	printf("done.\n");
	return ERROR_OK;
}

#if 0
/* Initialise Branch Target Buffer. From AN4670 */
static int mpc57xx_init_btb(struct target *target)
{
	int retval;
	uint32_t val, opcode;

	/* This is the code we need to run.
	 *	70 60 02 01		e_li	r3,513
	 *	7c 75 fb a6		mtspr	1013,r3
	 *	00 01			se_isync
	 */
	opcode = 0x70600201;
	retval = mpc57xx_exec_inst(&mpc57xx->jtag, opcode, 0, &val,
		(mpc57xx->saved_ctl & 0xFFFF0000) | MPC57XX_EI_INC);
	if (retval)
		return retval;

	opcode = 0x7c75fba6;
	retval = mpc57xx_exec_inst(&mpc57xx->jtag, opcode, 0, &val,
		(mpc57xx->saved_ctl & 0xFFFF0000) | MPC57XX_EI_INC);
	if (retval)
		return retval;

	opcode = 0x0001; /* how to specify 16bit instruction */
	retval = mpc57xx_exec_inst(&mpc57xx->jtag, opcode, 0, &val,
		(mpc57xx->saved_ctl & 0xFFFF0000) | MPC57XX_EI_INC);
	if (retval)
		return retval;

	return ERROR_OK;
}
#endif

#if 0
/* Supposed to performs 64bit writes to whole of SRAM to setup ECC
 * Takes a very long time over JTAG, so instead setup just the first 256 bytes.
 */
static int mpc57xx_init_sram(struct target *target)
{
	int retval;
	uint32_t val, addr;

	printf("init_sram");
	val = 0;
	for (addr = 0; addr < 256 ; addr += 4) {
		retval = mpc5xxx_write_memory(target, MPC57XX_START_OF_SRAM + addr,
			4, 1, (uint8_t *)&val);
		if (retval)
			return retval;
	}

	printf("done.\n");
	return ERROR_OK;
}
#endif

static int mpc57xx_init_pll(struct target *target)
{
	int retval;
	uint32_t val, retry;

	retval = target_write_u32(target, MPC57XX_FMPLL_ESYNCR2, 0x00000002);
	if (retval != ERROR_OK)
		return retval;

	/* Set 40MHz with 8MHz crystal */
	retval = target_write_u32(target, MPC57XX_FMPLL_ESYNCR1, 0xF0000000 + 40);
	if (retval != ERROR_OK)
		return retval;

	retry = 100; /* arbitrary limit */
	val = 0;
	while (retry && ((val & 8) == 0)) {
		retval = target_read_memory(target, MPC57XX_FMPLL_SYNSR, 4, 1,
				(uint8_t *)&val);
		val = be_to_h_u32((uint8_t *)&val); /* swap ends again */
		if (retval != ERROR_OK)
			return retval;
		retry--;
	}
	if (retry == 0) {
		printf("1. Failed to get PLL lock in expected time.\n");
		return ERROR_FAIL;
	}

	/* Set 64MHz with 8MHz crystal */
	retval = target_write_u32(target, MPC57XX_FMPLL_ESYNCR1, 0xF0000000 + 64);
	if (retval != ERROR_OK)
		return retval;

	return ERROR_OK;
}

static int mpc57xx_init_vectors(struct target *target)
{
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);
	int retval;
	uint32_t vec;
/* From Freescale init
 *	spr 63t $40000000
 *	spr 400t $0
 *	spr 401t $0
 *	spr 402t $0
 *	spr 403t $0
 *	spr 404t $0
 *	spr 405t $0
 *	spr 406t $0
 *	spr 407t $0
 *	spr 408t $0
 *	spr 409t $0
 *	spr 410t $0
 *	spr 411t $0
 *	spr 412t $0
 *	spr 413t $0    ; MMU data error vector points into valid memory
 *	spr 414t $0    ; MMU instruction error vector points into valid memory
 *	spr 415t $0
 */
	retval = mpc57xx_write_spr(&mpc57xx->jtag, 63, 0x40000000);
	if (retval)
		return retval;

	for (vec = 400; vec <= 415; vec++) {
		retval = mpc57xx_write_spr(&mpc57xx->jtag, vec, 0);
		if (retval)
			return retval;
		}

	return ERROR_OK;
}

static int mpc57xx_halt(struct target *target)
{
	int retval;

	printf("halt called\n");
	LOG_DEBUG("target->state: %s",  target_state_name(target));

	if (target->state == TARGET_HALTED) {
		LOG_DEBUG("target was already halted");
		return ERROR_OK;
	}

	if (target->state == TARGET_UNKNOWN)
		LOG_WARNING("target was in unknown state when halt was requested");

	if (target->state == TARGET_RESET) {
		if ((jtag_get_reset_config() & RESET_SRST_PULLS_TRST) && jtag_get_srst()) {
			LOG_ERROR("can't request a halt while in reset if nSRST pulls nTRST");
			return ERROR_TARGET_FAILURE;
		} else {
			target->debug_reason = DBG_REASON_DBGRQ;

			return ERROR_OK;
		}
	}

	printf("Supposed to halt, entering debug mode\n");
	retval = mpc57xx_debug_entry(target, 1);
	if (retval != ERROR_OK)
		return retval;

	target_call_event_callbacks(target, TARGET_EVENT_GDB_HALT);

