openocd-org/openocd/src/target/mpc57xx.c
	target->debug_reason = DBG_REASON_DBGRQ;
	target->state = TARGET_HALTED;

	return ERROR_OK;
}

static int mpc57xx_deassert_reset(struct target *target)
{
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);
	int retval;

	printf("mpc57xx_deassert_reset\n");
	printf("reset_halt = %d\n", target->reset_halt);
	if (target->reset_halt) {
		retval = mpc57xx_enter_debug(&mpc57xx->jtag, 1);
		if (retval)
			return retval;
		LOG_DEBUG("Enabled debug after reset");
	} else {
		/* Ensure those bits are clear */
		retval = mpc5xxx_once_write(&mpc57xx->jtag, MPC5XXX_ONCE_OCR, MPC5XXX_OCR_DEBUG_OFF, 32);
		if (retval)
			return retval;
		LOG_DEBUG("Disabled debug after reset");
	}

	printf("Disabling Interrupts\n") ;
	mpc57xx_enable_interrupts(target, 0) ;

	adapter_deassert_reset();

	if (target->reset_halt) {

		/* grab PC from boot vector */
		uint32_t pc;
		retval = mpc57xx_read_boot_vector(target, &pc);
		if (retval)
			return retval;
		printf("Boot PC = 0x%08x\n", pc);

		buf_set_u32(mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].value, 0, 32, pc);
		mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].dirty = 1;
		mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].valid = 1;
		retval = mpc57xx_write_reg(&mpc57xx->jtag, MPC5XXX_REG_PC, pc);
		if (retval)
			return retval;

		printf("Initialise Flash wait states\n");
		retval = mpc57xx_init_flash_ws(target);
		if (retval)
			return retval;

		/* Got as far as here, then found that S32 Design Studio includes a working OSBDM driver
		 * STOP...
		 */


		printf("STOP!!! NOT READY YET...\n");
		exit(1);

#if 0
		/* Initialise MMU */
		printf("Initialise MMU in C-code\n");
		retval = mpc57xx_init_mmu(target);
		if (retval)
			return retval;

		printf("Initialise SRAM in C-code\n");
		retval = mpc57xx_init_sram(target);
		if (retval)
			return retval;
#endif


		printf("Initialise PLL in C-code\n");
		retval = mpc57xx_init_pll(target);
		if (retval)
			return retval;
		printf("Intialise interrupt vectors\n");
		retval = mpc57xx_init_vectors(target);
		if (retval)
			return retval;
		retval = mpc57xx_debug_entry(target, 1);
		if (retval != ERROR_OK)
			return retval;

		target->debug_reason = DBG_REASON_DBGRQ;
		target->state = TARGET_HALTED;
	}
	return ERROR_OK;
}

static int mpc57xx_set_breakpoint(struct target *target,
		struct breakpoint *breakpoint)
{
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);
	struct mpc5xxx_comparator *comparator_list = mpc57xx->inst_break_list;
	int retval;

	if (breakpoint->set) {
		LOG_WARNING("breakpoint already set");
		return ERROR_OK;
	}

	if (breakpoint->type == BKPT_HARD) {
		int bp_num = 0;

		while (comparator_list[bp_num].used && (bp_num < mpc57xx->num_inst_bpoints))
			bp_num++;
		if (bp_num >= mpc57xx->num_inst_bpoints) {
			LOG_ERROR("Can not find free FP Comparator(bpid: %" PRIu32 ")",
					breakpoint->unique_id);
			return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
		}
		breakpoint->set = bp_num + 1;
		comparator_list[bp_num].used = 1;
		comparator_list[bp_num].bp_value = breakpoint->address;

		printf("Setting breakpoint #%d at 0x%08x\n", bp_num, (unsigned int)breakpoint->address);
		retval = mpc57xx_jtag_set_bp(&mpc57xx->jtag, bp_num, breakpoint->address);
		if (retval)
			return retval;

		LOG_DEBUG("bpid: %" PRIu32 ", bp_num %i bp_value 0x%" PRIx32 "",
				  breakpoint->unique_id,
				  bp_num, comparator_list[bp_num].bp_value);
	} else if (breakpoint->type == BKPT_SOFT) {
		LOG_DEBUG("bpid: %" PRIu32, breakpoint->unique_id);
		if (breakpoint->length == 4) {
			uint32_t verify = 0xffffffff;

			retval = target_read_memory(target, breakpoint->address, breakpoint->length, 1,
					breakpoint->orig_instr);
			if (retval != ERROR_OK)
				return retval;
			retval = target_write_u32(target, breakpoint->address, MPC57XX_SWBP);
			if (retval != ERROR_OK)
				return retval;

			retval = target_read_u32(target, breakpoint->address, &verify);
			if (retval != ERROR_OK)
				return retval;
			if (verify != MPC57XX_SWBP) {
				LOG_ERROR("Unable to set 32bit breakpoint at address %08" PRIx32
						" - check that memory is read/writable", (unsigned int)breakpoint->address);
				return ERROR_OK;
			}
		} else {
			uint16_t verify = 0xffff;

			retval = target_read_memory(target, breakpoint->address, breakpoint->length, 1,
					breakpoint->orig_instr);
			if (retval != ERROR_OK)
				return retval;
			retval = target_write_u16(target, breakpoint->address, MPC57XX_SWBP);
			if (retval != ERROR_OK)
				return retval;

			retval = target_read_u16(target, breakpoint->address, &verify);
			if (retval != ERROR_OK)
				return retval;
			if (verify != MPC57XX_SWBP) {
				LOG_ERROR("Unable to set 16bit breakpoint at address %08" PRIx32
						" - check that memory is read/writable", (unsigned int)breakpoint->address);
				return ERROR_OK;
			}
		}

		breakpoint->set = 20; /* Any nice value but 0 */
	}

	return ERROR_OK;
}

static int mpc57xx_enable_breakpoints(struct target *target)
{
	struct breakpoint *breakpoint = target->breakpoints;

	/* set any pending breakpoints */
	while (breakpoint) {
		if (breakpoint->set == 0)
			mpc57xx_set_breakpoint(target, breakpoint);
		breakpoint = breakpoint->next;
	}
	return ERROR_OK;
}

static int mpc57xx_unset_breakpoint(struct target *target,
		struct breakpoint *breakpoint)
{
	/* get pointers to arch-specific information */
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);
	struct mpc5xxx_comparator *comparator_list = mpc57xx->inst_break_list;
	int retval;

	if (!breakpoint->set) {
		LOG_WARNING("breakpoint not set");
		return ERROR_OK;
	}

	if (breakpoint->type == BKPT_HARD) {
		int bp_num = breakpoint->set - 1;
		if ((bp_num < 0) || (bp_num >= mpc57xx->num_inst_bpoints)) {
			LOG_DEBUG("Invalid FP Comparator number in breakpoint (bpid: %" PRIu32 ")",
					  breakpoint->unique_id);
			return ERROR_OK;
		}
		LOG_DEBUG("bpid: %" PRIu32 " - releasing hw: %d",
				breakpoint->unique_id,
				bp_num);
		comparator_list[bp_num].used = 0;
		comparator_list[bp_num].bp_value = 0;
		/*target_write_u32(target, comparator_list[bp_num].reg_address +
				 ejtag_info->ejtag_ibc_offs, 0);*/

	} else {
		/* restore original instruction (kept in target endianness) */
		LOG_DEBUG("bpid: %" PRIu32, breakpoint->unique_id);
		if (breakpoint->length == 4) {
			uint32_t current_instr;

