openocd-org/openocd/src/target/mpc57xx.c
			/* check that user program has not modified breakpoint instruction */
			retval = target_read_memory(target, breakpoint->address, 4, 1,
					(uint8_t *)&current_instr);
			if (retval != ERROR_OK)
				return retval;

			/**
			 * target_read_memory() gets us data in _target_ endianess.
			 * If we want to use this data on the host for comparisons with some macros
			 * we must first transform it to _host_ endianess using target_buffer_get_u32().
			 */
			current_instr = target_buffer_get_u32(target, (uint8_t *)&current_instr);

		} else {
			uint16_t current_instr;
			/* Not checked to see if this makes any sense JSM */
			/* check that user program has not modified breakpoint instruction */
			retval = target_read_memory(target, breakpoint->address, 2, 1,
					(uint8_t *)&current_instr);
			if (retval != ERROR_OK)
				return retval;
			current_instr = target_buffer_get_u16(target, (uint8_t *)&current_instr);

		}
	}
	breakpoint->set = 0;

	return ERROR_OK;
}

static int mpc57xx_add_breakpoint(struct target *target, struct breakpoint *breakpoint)
{
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);

	printf("Adding a breakpoint @ 0x%08x, type = %d\n", (unsigned int)breakpoint->address, breakpoint->type);
		if (breakpoint->type == BKPT_HARD) {
			if (mpc57xx->num_inst_bpoints_avail < 1) {
				LOG_INFO("no hardware breakpoint available");
				return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
			}

			mpc57xx->num_inst_bpoints_avail--;
		}

	return ERROR_OK;
}

static int mpc57xx_remove_breakpoint(struct target *target,
		struct breakpoint *breakpoint)
{
	/* get pointers to arch-specific information */
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);

	if (target->state != TARGET_HALTED) {
		LOG_WARNING("target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (breakpoint->set)
		mpc57xx_unset_breakpoint(target, breakpoint);

	if (breakpoint->type == BKPT_HARD)
		mpc57xx->num_inst_bpoints_avail++;

	return ERROR_OK;
}

static int mpc57xx_step(struct target *target, int current,
	target_addr_t address, int handle_breakpoints)
{
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);
	struct breakpoint *breakpoint = NULL;
	int retval;
	uint32_t addr, opcode, val;

	if (target->state != TARGET_HALTED) {
		LOG_WARNING("target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	/* current = 1: continue on current pc, otherwise continue at <address> */
	if (!current) {
		buf_set_u32(mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].value, 0, 32, address);
		mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].dirty = true;
		mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].valid = true;
	}

	/* the front-end may request us not to handle breakpoints */
	if (handle_breakpoints) {
		breakpoint = breakpoint_find(target,
				buf_get_u32(mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].value, 0, 32));
		if (breakpoint)
			mpc57xx_remove_breakpoint(target, breakpoint);
	}

	addr = buf_get_u32(mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].value, 0, 32);

	/* Fetch the instruction from that address */
	mpc5xxx_jtag_read_memory32(&mpc57xx->jtag,
		addr, 1, &val);

	/* Opcode comes back endian swapped, fix it. */
	opcode = ((val & 0x000000ff) << 24)
			| ((val & 0x0000ff00) << 8)
			| ((val & 0x00ff0000) >> 8)
			| ((val & 0xff000000) >> 24);

	/* restore context incl. setting PC*/
	mpc57xx_restore_context(target);


	/* disable interrupts while stepping */
	/*mpc57xx_enable_interrupts(target, 0);*/

	target->debug_reason = DBG_REASON_SINGLESTEP;
	target_call_event_callbacks(target, TARGET_EVENT_RESUMED);
	keep_alive();

	retval = mpc57xx_exec_inst(&mpc57xx->jtag, opcode, 0, &val,
			(mpc57xx->saved_ctl & 0xFFFF0000) | MPC57XX_EI_INC);

	if (retval)
		return retval;

	/* Fetch updated PC - may not be necessary ? */
	retval = mpc57xx_read_reg(&mpc57xx->jtag, MPC5XXX_REG_PC, &val);
	if (retval)
		return retval;

	/* registers are now invalid */
	register_cache_invalidate(mpc57xx->core_cache);

	mpc57xx_save_context(target);

	/* Save PC - not sure this is strictly necessary */
	buf_set_u32(mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].value, 0, 32, mpc57xx->core_regs[MPC5XXX_REG_PC]);

	/* Seems like these aren't handled correctly? GDB isn't getting new value. */
	mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].valid = true;

	if (breakpoint)
		mpc57xx_add_breakpoint(target, breakpoint);

	target_call_event_callbacks(target, TARGET_EVENT_HALTED);

	return ERROR_OK;
}

static int mpc57xx_set_watchpoint(struct target *target,
		struct watchpoint *watchpoint)
{
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);
	struct mpc5xxx_comparator *comparator_list = mpc57xx->data_break_list;
	int retval;

	if (watchpoint->set) {
		LOG_WARNING("watchpoint already set");
		return ERROR_OK;
	}

	int wp_num = 0;

	while (comparator_list[wp_num].used && (wp_num < mpc57xx->num_data_bpoints))
		wp_num++;
	if (wp_num >= mpc57xx->num_data_bpoints) {
		LOG_ERROR("Can not find free FP Comparator(wpid: %" PRIu32 ")",
				watchpoint->unique_id);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}
	watchpoint->set = wp_num + 1;
	comparator_list[wp_num].used = 1;
	comparator_list[wp_num].bp_value = watchpoint->address;

	printf("Actually need to set watchpoint #%d at 0x%08x\n", wp_num, (unsigned int)watchpoint->address);
	retval = mpc57xx_jtag_set_wp(&mpc57xx->jtag, wp_num, watchpoint->address);
	if (retval)
		return retval;

	LOG_DEBUG("wpid: %" PRIu32 ", wp_num %i bp_value 0x%" PRIx32 "",
			  watchpoint->unique_id,
			  wp_num, comparator_list[wp_num].bp_value);

	watchpoint->set = 20; /* Any nice value but 0 */

	return ERROR_OK;
}

static int mpc57xx_enable_watchpoints(struct target *target)
{
	struct watchpoint *watchpoint = target->watchpoints;

	/* set any pending breakpoints */
	while (watchpoint) {
		if (watchpoint->set == 0)
			mpc57xx_set_watchpoint(target, watchpoint);
		watchpoint = watchpoint->next;
	}
	return ERROR_OK;
}

static int mpc57xx_unset_watchpoint(struct target *target,
		struct watchpoint *watchpoint)
{
	/* get pointers to arch-specific information */
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);
	struct mpc5xxx_comparator *comparator_list = mpc57xx->data_break_list;

	if (!watchpoint->set) {
		LOG_WARNING("breakpoint not set");
		return ERROR_OK;
	}

	int wp_num = watchpoint->set - 1;
	if ((wp_num < 0) || (wp_num >= mpc57xx->num_data_bpoints)) {
		LOG_DEBUG("Invalid FP Comparator number in breakpoint (wpid: %" PRIu32 ")",
				  watchpoint->unique_id);
		return ERROR_OK;
	}
	LOG_DEBUG("wpid: %" PRIu32 " - releasing hw: %d",
			watchpoint->unique_id,
			wp_num);
	comparator_list[wp_num].used = 0;
	comparator_list[wp_num].bp_value = 0;
		/*target_write_u32(target, comparator_list[bp_num].reg_address +
				 ejtag_info->ejtag_ibc_offs, 0);*/

	watchpoint->set = 0;

	return ERROR_OK;
}


