openocd-org/openocd/src/target/mpc57xx.c
static int mpc57xx_add_watchpoint(struct target *target, struct watchpoint *watchpoint)
{
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);

	if (mpc57xx->num_inst_bpoints_avail < 1) {
		LOG_INFO("no hardware watchpoints available");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	mpc57xx->num_inst_bpoints_avail--;

	return ERROR_OK;
}

static int mpc57xx_remove_watchpoint(struct target *target,
	struct watchpoint *watchpoint)
{
	/* get pointers to arch-specific information */
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);

	if (target->state != TARGET_HALTED) {
		LOG_WARNING("target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (watchpoint->set)
		mpc57xx_unset_watchpoint(target, watchpoint);

	mpc57xx->num_inst_bpoints_avail++;

	return ERROR_OK;
}


static int mpc57xx_resume(struct target *target, int current,
	target_addr_t address, int handle_breakpoints, int debug_execution)
{
	struct mpc5xxx_common *mpc57xx = target_to_mpc5xxx(target);
	struct breakpoint *breakpoint = NULL;
	uint32_t resume_pc;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_WARNING("1. target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (!debug_execution) {
		target_free_all_working_areas(target);

		retval = mpc57xx_jtag_clr_bps_wps(&mpc57xx->jtag);
		if (retval)
			return retval;

		retval = mpc57xx_enable_breakpoints(target);
		if (retval)
			return retval;

		retval = mpc57xx_enable_watchpoints(target);
		if (retval)
			return retval;
	}

	/* current = 1: continue on current pc, otherwise continue at <address> */
	if (!current) {
		buf_set_u32(mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].value, 0, 32, address);
		mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].dirty = 1;
		mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].valid = 1;
		resume_pc = address;
	} else {
		resume_pc = buf_get_u32(mpc57xx->core_cache->reg_list[MPC5XXX_REG_PC].value, 0, 32);
	}

	retval = mpc57xx_restore_context(target);
	if (retval)
		return retval;

	/* the front-end may request us not to handle breakpoints */
	if (handle_breakpoints) {
		/* Single step past breakpoint at current address */
		breakpoint = breakpoint_find(target, resume_pc);
		if (breakpoint) {
			printf("Not yet handling resuming on breakpoint\n");
#if 0
			LOG_DEBUG("unset breakpoint at 0x%8.8" PRIx32 "", breakpoint->address);
			mpc57xx_unset_breakpoint(target, breakpoint);
			mpc57xx_single_step_core(target);
			mpc57xx_set_breakpoint(target, breakpoint);
#endif
		}
	}
#if 0

	/* enable interrupts if we are running */
	mpc57xx_enable_interrupts(target, !debug_execution);
#endif
	/* exit debug mode */
	if (mpc57xx->msr_on_entry & MPC5XXX_MSR_EE) {
		printf("Re-enabling interrupts ? debug_execution = %d\n", debug_execution) ;
		mpc57xx_enable_interrupts(target, debug_execution ? 0 : 1) ;
	} else {
		printf("Not Re-enabling interrupts ? debug_execution = %d\n", debug_execution) ;

	}
	/* 1 was handle_breakpoints */
	retval = mpc57xx_exit_debug(&mpc57xx->jtag, resume_pc, 1, mpc57xx->ctl_on_entry);

	if (retval)
		return retval;

	target->debug_reason = DBG_REASON_NOTHALTED;

	/* registers are now invalid */
	register_cache_invalidate(mpc57xx->core_cache);

	if (!debug_execution) {
		target->state = TARGET_RUNNING;
		target_call_event_callbacks(target, TARGET_EVENT_RESUMED);
		LOG_DEBUG("target resumed at 0x%" PRIx32 "", resume_pc);
	} else {
		target->state = TARGET_DEBUG_RUNNING;
		target_call_event_callbacks(target, TARGET_EVENT_DEBUG_RESUMED);
		LOG_DEBUG("target debug resumed at 0x%" PRIx32 "", resume_pc);
	}

	return ERROR_OK;
}

static int mpc57xx_target_create(struct target *target, Jim_Interp *interp)
{
	struct mpc5xxx_common *mpc57xx = calloc(1, sizeof(struct
			mpc5xxx_common));
	printf("target_create\n");
	mpc57xx->common_magic = MPC57XX_COMMON_MAGIC;
	target->arch_info = mpc57xx;

	mpc57xx->jtag.once = MPC57XX_TAP_ONCE1; /* Default to CPU1 */
	mpc57xx->jtag.current_tap = MPC5XXX_TAP_INVALID; /* Invalid to force TAP selection */
	mpc57xx->jtag.jtag_irlen = 6;

	return ERROR_OK;
}

/* read registers from the MCU and copy them to core_regs etc. */
/* this function disables interrupts if they are enabled ... */
/* result will however be reported correctly */
int mpc57xx_save_context(struct target *target)
{
	int retval, i;
	struct mpc5xxx_common *mpc56xx = target_to_mpc5xxx(target);

	/*printf("save_context\n");*/
	keep_alive();
	retval = mpc57xx_jtag_read_regs(&mpc56xx->jtag, mpc56xx->core_regs, &mpc56xx->saved_ctl);
	if (retval != ERROR_OK)
		return retval;

	mpc56xx->saved_msr = mpc56xx->core_regs[MPC5XXX_REG_MSR] ;

	/* now we saved the sate of the msr before we disabled interrupts,
	 * we can stop lying about disabled interrupts - otherwise
	 * restore_context will re-enable them
	 */

	mpc56xx->core_regs[MPC5XXX_REG_MSR] &= ~MPC5XXX_MSR_EE ;

	for (i = 0; i < MPC5XXX_NUMCOREREGS; i++) {
		if (!mpc56xx->core_cache->reg_list[i].valid)
			mpc5xxx_read_core_reg(target, i);
	}

	keep_alive();

	/*printf("end save context\n");*/
	keep_alive();
	return ERROR_OK;
}

/* restore registers and state to the MCU */
int mpc57xx_restore_context(struct target *target)
{
	int i, retval;
	struct mpc5xxx_cpuscr scr;

	/*printf("restore_context\n");*/

	/* get pointers to arch-specific information */
	struct mpc5xxx_common *mpc56xx = target_to_mpc5xxx(target);

	for (i = 0; i < MPC5XXX_NUMCOREREGS; i++) {
		if (mpc56xx->core_cache->reg_list[i].dirty)
			mpc5xxx_write_core_reg(target, i);
	}

	/* write core regs */
	mpc57xx_jtag_write_regs(&mpc56xx->jtag, mpc56xx->core_regs);

	/* Restore CTL */
	retval = mpc5xxx_once_cpuscr_read(&mpc56xx->jtag, &scr);
	if (retval)
		return retval;
	scr.ctl = mpc56xx->saved_ctl;
	return mpc5xxx_once_cpuscr_write(&mpc56xx->jtag, &scr);
}


struct target_type mpc57xx_target = {
	.name = "mpc57xx",

	.poll = mpc57xx_poll,
	.arch_state = mpc5xxx_arch_state,

	.halt = mpc57xx_halt,
	.resume = mpc57xx_resume,
	.step = mpc57xx_step,

	.assert_reset = mpc5xxx_assert_reset,
	.deassert_reset = mpc57xx_deassert_reset,

	.get_gdb_reg_list = mpc5xxx_get_gdb_reg_list,

	.read_memory = mpc5xxx_read_memory,
	.write_memory = mpc5xxx_write_memory,
	/* .checksum_memory = mpc57xx_checksum_memory, */
	/* .blank_check_memory = mpc57xx_blank_check_memory, */

	/* .run_algorithm = mpc57xx_run_algorithm, */

	.add_breakpoint = mpc57xx_add_breakpoint,
	.remove_breakpoint = mpc57xx_remove_breakpoint,
	.add_watchpoint = mpc57xx_add_watchpoint,
	.remove_watchpoint = mpc57xx_remove_watchpoint,

	.target_create = mpc57xx_target_create,
	.init_target = mpc5xxx_init_target,
	.examine = mpc5xxx_examine,
};
